##########It is to be noted that, out of 13 CQs, 10 CQs we can capture using SPARQL queries. We are in the process of evaluating the three remaining CQs (explained below beside each remaining CQ) which depends on the steps of our future research.(Future Work).


CQ1: Does the OSN store my data for an indefinite time?
Query: select ?DurationPeriod ?Type  where {
    ?Organization oppo:hasPolicy ?Policy.
    ?Policy oppo:hasDataPractice ?DataPractice.
    ?DataPractice oppo:hasDurationPractice ?DurationPeriod.
    ?DurationPeriod rdf:type ?Type FILTER (?Type in (oppo:IndefiniteDurationDescription)).

}
   
 Result: Raw Response: 
 
 {
  "head": {
    "vars": [
      "DurationPeriod",
      "Type"
    ]
  },
  "results": {
    "bindings": [
      {
        "DurationPeriod": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#As_Long_Telgram_Needs"
        },
        "Type": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#IndefiniteDurationDescription"
        }
      }
    ]
  }
}

CQ2: How can I request to modify the stored data and how long does it take to process my request?
Query: 
select  ?Organization ?ModificationRequestType ?RectificationRequestDelay where {
    ?Organization oppo:hasPolicy ?Policy.
    ?Policy oppo:hasDataPractice ?Practice.
    ?Practice oppo:hasRequestType ?ModificationRequestType.
   ?Practice oppo:hasResponseDelay ?RectificationRequestDelay.

}

Result: Raw Response: 
{
  "head": {
    "vars": [
      "Organization",
      "ModificationRequestType",
      "RectificationRequestDelay"
    ]
  },
  "results": {
    "bindings": [
      {
        "Organization": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#Telegram"
        },
        "ModificationRequestType": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#GDPRbot"
        },
        "RectificationRequestDelay": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#the_earliest_opportunity"
        }
      }
    ]
  }
}



CQ3: What kind of encryption mechanisms has been applied to my secret chats and media files?
Query: select  ?EncryptionMechanism ?Data   where {
    ?Organization oppo:hasPolicy ?Policy.
    ?Policy oppo:hasDataPractice ?Practice.
    ?Practice oppo:hasEncryptionTechnique ?EncryptionMechanism.
    ?EncryptionMechanism oppo:appliesTo ?Data FILTER (?Data in (oppo:Photos, oppo:SecretChat, oppo:Video)).
}

Result (RawResponse): {
  "head": {
    "vars": [
      "EncryptionMechanism",
      "Data"
    ]
  },
  "results": {
    "bindings": [
      {
        "EncryptionMechanism": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#EncryptionPractice1"
        },
        "Data": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#Photos"
        }
      },
      {
        "EncryptionMechanism": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#End-to-End-Encryption"
        },
        "Data": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#SecretChat"
        }
      },
      {
        "EncryptionMechanism": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#EncryptionPractice1"
        },
        "Data": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#Video"
        }
      }
    ]
  }
}




CQ4.  Which OSNs define what one storage practices?   ##Instead of explicitly declaring rdf:type oppo:DataStoragePractice, we retrieved the practices using relations.

Query: select ?Organization ?DataPractice ?storagerelation where {
    ?Organization oppo:hasPolicy ?Policy.
    ?Policy oppo:hasDataPractice ?DataPractice.  
    ?DataPractice ?storagerelation ?a FILTER (?storagerelation in (oppo:hasDurationPractice,oppo:hasResponseDelay,oppo:hasRequestType, oppo:hasResponseType, oppo:hasStorageEntity, oppo:hasStorageLocation)).

}

Result: {
  "head": {
    "vars": [
      "Organization",
      "DataPractice",
      "storagerelation"
    ]
  },
  "results": {
    "bindings": [
      {
        "Organization": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#Telegram"
        },
        "DataPractice": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#DataStorageStorageDurationPractice1"
        },
        "storagerelation": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#hasDurationPractice"
        }
      },
      {
        "Organization": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#Telegram"
        },
        "DataPractice": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#DataStorageModificationPractice1"
        },
        "storagerelation": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#hasResponseDelay"
        }
      },
      {
        "Organization": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#Telegram"
        },
        "DataPractice": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#DataStorageModificationPractice1"
        },
        "storagerelation": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#hasRequestType"
        }
      },
      {
        "Organization": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#Telegram"
        },
        "DataPractice": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#DataStorageLocationPractice1"
        },
        "storagerelation": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#hasStorageEntity"
        }
      },
      {
        "Organization": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#Telegram"
        },
        "DataPractice": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#DataStorageLocationPractice1"
        },
        "storagerelation": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#hasStorageLocation"
        }
      }
    ]
  }
}




CQ5 (old).  Is there any OSN's data practice that stores data for an indefinite amount of time? 
CQ5 (new).  What kinds of data the OSN stores for an indefinite amount of time? (A more user centric question. We project ?DataPractice and ?Data to provide detailed information.)

Query: select  ?DurationPeriod ?DataPractice ?Data  where {
    ?Organization oppo:hasPolicy ?Policy.
    ?Policy oppo:hasDataPractice ?DataPractice.
    ?DataPractice oppo:hasDurationPractice ?DurationPeriod.
    ?DataPractice oppo:actsOn ?Data.
    ?DurationPeriod rdf:type ?Type FILTER (?Type in (oppo:IndefiniteDurationDescription)).

}
  
Result: {
  "head": {
    "vars": [
      "DurationPeriod",
      "DataPractice",
      "Data"
    ]
  },
  "results": {
    "bindings": [
      {
        "DurationPeriod": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#As_Long_Telgram_Needs"
        },
        "DataPractice": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#DataStorageStorageDurationPractice1"
        },
        "Data": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#Email"
        }
      },
      {
        "DurationPeriod": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#As_Long_Telgram_Needs"
        },
        "DataPractice": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#DataStorageStorageDurationPractice1"
        },
        "Data": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#PublicChat"
        }
      },
      {
        "DurationPeriod": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#As_Long_Telgram_Needs"
        },
        "DataPractice": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#DataStorageStorageDurationPractice1"
        },
        "Data": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#AboutInformation"
        }
      },
      {
        "DurationPeriod": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#As_Long_Telgram_Needs"
        },
        "DataPractice": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#DataStorageStorageDurationPractice1"
        },
        "Data": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#Photos"
        }
      },
      {
        "DurationPeriod": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#As_Long_Telgram_Needs"
        },
        "DataPractice": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#DataStorageStorageDurationPractice1"
        },
        "Data": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#Location"
        }
      },
      {
        "DurationPeriod": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#As_Long_Telgram_Needs"
        },
        "DataPractice": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#DataStorageStorageDurationPractice1"
        },
        "Data": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#PhoneNumber"
        }
      },
      {
        "DurationPeriod": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#As_Long_Telgram_Needs"
        },
        "DataPractice": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#DataStorageStorageDurationPractice1"
        },
        "Data": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#SecretChat"
        }
      }
    ]
  }
}

**CQ6.  Which OSNs define what kind of visibility storage practices?**  (**Visibility Storage Practice** It is to be noted that a user may want to know who have access (DataSurbject or  DataRecipient ) to the collected, shared, or transferred data? Thus in order to answer this question, we are also required consider other data practices (collection or sharing), which we have left for the future work (outlined in Section 7 point 2).)

CQ7.  Does OSN X(Telegram) store my *messages* for an indefinite amount of time? 

Query: select  ?DurationPeriod ?Data  where {
    ?Organization oppo:hasPolicy ?Policy.
    ?Policy oppo:hasDataPractice ?DataPractice.
    ?DataPractice oppo:hasDurationPractice ?DurationPeriod.
   ?DataPractice oppo:actsOn ?Data FILTER (?Data in (oppo:SecretChat, oppo:PublicChat)).
}

Result: {
  "head": {
    "vars": [
      "DurationPeriod",
      "Data"
    ]
  },
  "results": {
    "bindings": [
      {
        "DurationPeriod": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#As_Long_Telgram_Needs"
        },
        "Data": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#SecretChat"
        }
      },
      {
        "DurationPeriod": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#As_Long_Telgram_Needs"
        },
        "Data": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#PublicChat"
        }
      }
    ]
  }
}


CQ8.  What kind of security mechanisms have been applied to my videos and images? (Eventhough we did not explicitly mention "hasSecurityMechanism" in the dataset, the query can fetch them by checking the subproeprty of hasSecurityMechanism)

Query: select ?SecurityType ?Data  where {
    ?Organization oppo:hasPolicy ?Policy.
    ?Policy oppo:hasDataPractice ?DataPractice.
    ?SecurityType rdfs:subPropertyOf oppo:hasSecurityMechanism.
    ?DataPractice ?SecurityType ?SecurityMechanism.
    ?SecurityMechanism oppo:appliesTo ?Data FILTER (?Data in (oppo:Video, oppo:Photos)).
}
Result: 
{
  "head": {
    "vars": [
      "SecurityType",
      "Data"
    ]
  },
  "results": {
    "bindings": [
      {
        "SecurityType": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#hasSecurityMechanism"
        },
        "Data": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#Video"
        }
      },
      {
        "SecurityType": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#hasEncryptionTechnique"
        },
        "Data": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#Video"
        }
      },
      {
        "SecurityType": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#hasSecurityMechanism"
        },
        "Data": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#Photos"
        }
      },
      {
        "SecurityType": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#hasEncryptionTechnique"
        },
        "Data": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#Photos"
        }
      }
    ]
  }
}


CQ9.  How and where does the OSN store the collected information?

Query: select ?Location ?StorageEntity  where {
    ?Organization oppo:hasPolicy ?Policy.
    ?Policy oppo:hasDataPractice ?DataPractice.
    ?DataPractice oppo:hasStorageLocation ?Location.
    ?DataPractice oppo:hasStorageEntity ?StorageEntity.


}

Result: {
  "head": {
    "vars": [
      "Location",
      "StorageEntity"
    ]
  },
  "results": {
    "bindings": [
      {
        "Location": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#Netherlands"
        },
        "StorageEntity": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#DataServers"
        }
      }
    ]
  }
}
CQ10.  What data practices potentially do not comply with the regulation the OSN follows? (Future Work, outlined in Section 7)


CQ11.  What types of security mechanisms are applied to a special data type, such as religious belief or biometric data? (Here we can filter with the different types of data)

CQ11. (Alternative) What types of security mechanisms are applied to a personal data type, such as religious belief or biometric data? (Here we can filter with just stating "PersonalData")
 

Query: select DISTINCT ?SecurityMechanism ?Data ?DataType  where {
    ?Organization oppo:hasPolicy ?Policy.
    ?Policy oppo:hasDataPractice ?DataPractice.
    ?SecurityType rdfs:subPropertyOf oppo:hasSecurityMechanism.
    ?DataPractice ?SecurityType ?SecurityMechanism.
    ?SecurityMechanism oppo:appliesTo ?Data.
    ?Data rdf:type ?DataType FILTER (?DataType in (oppo:IdentitiyData,oppo:ActivityData,oppo:BiomentricData,oppo:IdentitiyData)).
	#####**Alternative**  ?Data rdf:type ?DataType FILTER (?DataType in (oppo:PersonalData)).
}

Result: 
{
  "head": {
    "vars": [
      "SecurityMechanism",
      "Data",
      "DataType"
    ]
  },
  "results": {
    "bindings": [
      {
        "SecurityMechanism": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#End-to-End-Encryption"
        },
        "Data": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#Location"
        },
        "DataType": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#IdentitiyData"
        }
      },
      {
        "SecurityMechanism": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#EncryptionPractice1"
        },
        "Data": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#Email"
        },
        "DataType": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#IdentitiyData"
        }
      },
      {
        "SecurityMechanism": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#EncryptionPractice1"
        },
        "Data": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#PhoneNumber"
        },
        "DataType": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#IdentitiyData"
        }
      },
      {
        "SecurityMechanism": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#End-to-End-Encryption"
        },
        "Data": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#SecretChat"
        },
        "DataType": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#ActivityData"
        }
      },
      {
        "SecurityMechanism": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#EncryptionPractice1"
        },
        "Data": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#PublicChat"
        },
        "DataType": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#ActivityData"
        }
      },
      {
        "SecurityMechanism": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#EncryptionPractice1"
        },
        "Data": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#Photos"
        },
        "DataType": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#BiomentricData"
        }
      },
      {
        "SecurityMechanism": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#EncryptionPractice1"
        },
        "Data": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#Video"
        },
        "DataType": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#BiomentricData"
        }
      }
    ]
  }
}

CQ12. Which OSNs do not define any visibility storage practices? (Future Work, outlined in Section 7)

CQ13. For which purposes the OSN stores what types of data? (open-world assumption. Telegram does not specify the purpose of collecting or storing data)
####We Agree that a robust query is required to capture the complement of the MarketingPurpose####
Query: select  ?Purpose ?PurposeType  ?PurposeCategory  where {
    ?Organization oppo:hasPolicy ?Policy.
    ?Policy oppo:hasDataPractice ?DataPractice.   
    ?DataPractice oppo:hasPurpose ?Purpose.
    ?Purpose ?PurposeType ?PurposeCategory.

}

Result: {
  "head": {
    "vars": [
      "Purpose",
      "PurposeType",
      "PurposeCategory"
    ]
  },
  "results": {
    "bindings": [
      {
        "Purpose": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#Purpose1"
        },
        "PurposeType": {
          "type": "uri",
          "value": "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        },
        "PurposeCategory": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#Purpose"
        }
      },
      {
        "Purpose": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#Purpose1"
        },
        "PurposeType": {
          "type": "uri",
          "value": "http://www.w3.org/1999/02/22-rdf-syntax-ns#type"
        },
        "PurposeCategory": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#Entity"
        }
      },
      {
        "Purpose": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#Purpose1"
        },
        "PurposeType": {
          "type": "uri",
          "value": "http://www.w3.org/2002/07/owl#complementOf"
        },
        "PurposeCategory": {
          "type": "uri",
          "value": "http://umaine.edu/oppo/core/v1#MarketingPurpose"
        }
      }
    ]
  }
}


